Revit 2024 API
RevolvedFace.Radius Property
Radius of the surface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public XYZ this[
	int index
] { get; }
Visual Basic
Public ReadOnly Property Radius ( _
	index As Integer _
) As XYZ
	Get
Visual C++
public:
property XYZ^ Radius[int index] {
	XYZ^ get (int index);
}
Parameters
index
Type: System.Int32
See Also
RevolvedFace Class
Autodesk.Revit.DB Namespace